MusicApp/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def show
        @band = Band.find_by(name: params[:name])